frisbee_golf_api/app/controllers/api/v1/courses_controller.rb

    def create
        course = Api::V1::Course.create(course_params)
---
INSERT INTO "api_v1_courses" ("name", "city", "state", "holes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "White Lightning"], ["city", "Toms River"], ["state", "NJ"], ["holes", 2], ["created_at", "2020-12-07 21:57:10.835089"], ["updated_at", "2020-12-07 21:57:10.835089"]]

    def update
        @course = Api::V1::Course.find_by_id(params[:id])
        # debugger
        @course.update(tally: @course.tally + 1, votes: @course.votes += params[:vote])
---
UPDATE "api_v1_courses" SET "tally" = ?, "votes" = ?, "updated_at" = ? WHERE "api_v1_courses"."id" = ?  [["tally", 1], ["votes", 5], ["updated_at", "2020-12-07 22:36:21.060178"], ["id", 1]]